InformationRegisters/НастройкиОбменаЕИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаЕИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПолученияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПолученияКонтрактов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторУчастникаДокументооборота</Name>
					<Comment>Строка длиной от 4 до 46 символов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>46</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоСПЗ</Name>
					<Comment>Используется для заказчиков гос.контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСводногоРеестра</Name>
					<Comment>Код в сводном реестре участников бюждетного процесса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицевойСчетДляКазначейскогоСопровождения</Name>
					<Comment>Используется для заполнения поля ЛицСчетКС в приложении для ЕИС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеОрганизации</Name>
					<Comment>Строка 1000 символов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерЕРУЗ</Name>
					<Comment>Используется для поставщиков по гос.контракту</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОПодписантах</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчастниковЭлектронногоАктированияЕИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыУчастниковЭлектронногоАктированияЕИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыУчастниковЭлектронногоАктированияЕИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиОбменаЕИС/Forms/ФормаМастера/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
	ИспользуетсяНесколькоОрганизаций = ЭлектронноеАктированиеЕИСВызовСервера.
		ИспользуетсяНесколькоОрганизаций();
	
	Если НЕ ИспользуетсяНесколькоОрганизаций И НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЭлектронноеАктированиеЕИС.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ЭлектронноеАктированиеЕИСВызовСервера.
		СкрытьЭлементыФормыПриИспользованииОднойОрганизации(ЭтотОбъект, "Организация");
	
	ЗаполнитьТекущиеНастройки();
	УправлениеЭУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОрганизацияПриИзменении(Элементы.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантыНадписьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Подписанты", Новый Массив);
	Для каждого Строка Из Подписанты Цикл
		Подписант = Новый Структура("ФИО, Должность");
		ЗаполнитьЗначенияСвойств(Подписант, Строка);
		ПараметрыФормы.Подписанты.Добавить(Подписант);
	КонецЦикла;
	ОткрытьФорму("РегистрСведений.НастройкиОбменаЕИС.Форма.ФормаПодписантов",
		ПараметрыФормы, ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьТекущиеНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияЭтаповОбработкаНавигационнойСсылки(Элемент,
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "МастерНастройки" Тогда
		Ссылка = ГиперссылкаАвтоматическаяНастройка();
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"РаботаМастераНастройкиЗавершение", ЭтотОбъект);
		НачатьЗапускПриложения(ОписаниеОповещения, Ссылка, , Истина);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Инструкция" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОткрытияИнструкцийЗавершение", ЭтотОбъект);
		НачатьЗапускПриложения(ОписаниеОповещения, ГиперссылкаИнструкция());
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЛичныйКабинетЕИС" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьЛичныйКабинетЕИСЗавершение", ЭтотОбъект);
		ГиперссылкаЛК = ГиперссылкаЛичныйКабинет();
		НачатьЗапускПриложения(ОписаниеОповещения,
			ГиперссылкаЛК, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерЕРУЗПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ДанныеЛичногоКабинетаПолучены = Ложь;
	УправлениеЭУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТокенАвторизацииПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ДанныеЛичногоКабинетаПолучены = Ложь;
	УправлениеЭУ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Модифицированность И НЕ ДанныеЛичногоКабинетаПолучены Тогда
		ТекстОшибки = ЗаполнитьСведенияОПоставщике();
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			ЭлектронноеАктированиеЕИСКлиент.ВывестиОшибку(ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗаписи = ПодготовитьДанныеЗаписиРегистра();
	СохранитьНастройкиОбменаЕИС(СтруктураЗаписи);
	Модифицированность = Ложь;
	Закрыть(Истина);
	Оповестить(ЭлектронноеАктированиеЕИСКлиент.ИмяСобытияСохраненияНастроекПодключения());
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСведенияОбУчастнике(Команда)
	
	Если ЕстьДанныеДляПолученияСведений(Истина) Тогда
		ТекстОшибки = ЗаполнитьСведенияОПоставщике();
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			ЭлектронноеАктированиеЕИСКлиент.ВывестиОшибку(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ГиперссылкаЛичныйКабинет()
	
	Возврат ЭлектронноеАктированиеЕИС.ГиперссылкаНаЛичныйКабинетУчастникаГосзакупок();
	
КонецФункции

&НаСервереБезКонтекста
Функция ГиперссылкаИнструкция()
	
	Возврат ЭлектронноеАктированиеЕИС.ГиперссылкаНаИнструкциюПоРучнойНастройкеРабочегоМеста();
	
КонецФункции

&НаСервереБезКонтекста
Функция ГиперссылкаАвтоматическаяНастройка()
	
	Возврат ЭлектронноеАктированиеЕИС.ГиперссылкаНаИнструкциюПоАвтоматическойНастройкеРабочегоМеста();
	
КонецФункции

&НаКлиенте
Процедура РаботаМастераНастройкиЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(КодВозврата) Тогда
		Шаблон = НСтр("ru='Не удалось открыть страницу загрузки мастера настройки. Операционная система вернула код %1.'");
		ТекстОшибки = СтрШаблон(Шаблон, КодВозврата);
		ЭлектронноеАктированиеЕИСКлиент.ВывестиОшибку(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытияИнструкцийЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(КодВозврата) Тогда
		Шаблон = НСтр("ru='Не удалось открыть инструкцию. Операционная система вернула код %1.'");
		ТекстОшибки = СтрШаблон(Шаблон, КодВозврата);
		ЭлектронноеАктированиеЕИСКлиент.ВывестиОшибку(ТекстОшибки);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛичныйКабинетЕИСЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(КодВозврата) Тогда
		Шаблон = НСтр("ru='Не удалось открыть личный кабинет. Операционная система вернула код %1.'");
		ТекстОшибки = СтрШаблон(Шаблон, КодВозврата);
		ЭлектронноеАктированиеЕИСКлиент.ВывестиОшибку(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеЗаписиРегистра()
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Организация", Организация);
	СтруктураЗаписи.Вставить("ТокенАвторизации", ТокенАвторизации);
	СтруктураЗаписи.Вставить("РегистрационныйНомерЕРУЗ", РегистрационныйНомерЕРУЗ);
	СтруктураЗаписи.Вставить("ИдентификаторУчастникаДокументооборота",
		ИдентификаторУчастникаДокументооборота);
	СтруктураЗаписи.Вставить("ТипОрганизации",
		Перечисления.ВидыУчастниковЭлектронногоАктированияЕИС.Поставщик);
	СтруктураЗаписи.Вставить("НаименованиеОрганизации", НаименованиеОрганизации);
	СтруктураЗаписи.Вставить("ОбменВключен", Истина);
	
	Возврат СтруктураЗаписи;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСведенияОПоставщике()
	
	Результат = "";
	
	СтруктураЗаписи = ПодготовитьДанныеЗаписиРегистра();
	РезультатСведенияОПоставщике =
		ЭлектронноеАктированиеЕИС.СведенияОПоставщикеИЕгоПодписантах(Организация, СтруктураЗаписи);
	Если РезультатСведенияОПоставщике.Выполнено Тогда
		СведенияОПоставщике = РезультатСведенияОПоставщике.СведенияОПоставщике;
		ИдентификаторУчастникаДокументооборота =
			СведенияОПоставщике.ИдентификаторУчастникаДокументооборота;
		НаименованиеОрганизации = СведенияОПоставщике.ПолноеНаименование;
		Подписанты.Очистить();
		Для каждого Подписант Из СведенияОПоставщике.Подписанты Цикл
			Строка = Подписанты.Добавить();
			Строка.ФИО = СтрШаблон("%1 %2 %3", Подписант.Фамилия,
				Подписант.Имя, Подписант.Отчество);
			Строка.Должность = Подписант.Должность;
			ЭлектронноеАктированиеЕИС.СохранитьПодписанта(Организация, Подписант)
		КонецЦикла;
		СклоняемаяСтрока = НСтр("ru='сотрудник'");
		КоличествоПодписантов = Подписанты.Количество();
		ПодписантыНадпись = ПолучитьСклоненияСтрокиПоЧислу(
			СклоняемаяСтрока,
			КоличествоПодписантов, ,
			"ЧС=Количественное",
			"ПД=Именительный")[0];
		ДанныеЛичногоКабинетаПолучены = Истина;
	Иначе
		Результат = РезультатСведенияОПоставщике.ОписаниеОшибки;
		ДанныеЛичногоКабинетаПолучены = Ложь;
	КонецЕсли;
	
	УправлениеЭУ();
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УправлениеЭУ()
	
	Если ДанныеЛичногоКабинетаПолучены Тогда
		Элементы.НаименованиеОрганизации.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
		Элементы.ИдентификаторУчастникаДокументооборота.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
		Элементы.ПодписантыНадпись.ЦветТекста = ЭлектронноеАктированиеЕИС.ЦветТекстаГиперссылки();
		Элементы.ПодписантыНадпись.Гиперссылка = Истина;
	Иначе
		НаименованиеОрганизации = НадписьТребуетсяПолучитьЗначение();
		ИдентификаторУчастникаДокументооборота = НадписьТребуетсяПолучитьЗначение();
		ПодписантыНадпись = НадписьТребуетсяПолучитьЗначение();
		
		СерыйЦвет = ЭлектронноеАктированиеЕИС.ЦветТекстаСерый();
		Элементы.НаименованиеОрганизации.ЦветТекста = СерыйЦвет;
		Элементы.ИдентификаторУчастникаДокументооборота.ЦветТекста = СерыйЦвет;
		Элементы.ПодписантыНадпись.ЦветТекста = СерыйЦвет;
		Элементы.ПодписантыНадпись.Гиперссылка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОбменаЕИС(СтруктураЗаписи)
	
	НоваяНастройка = РегистрыСведений.НастройкиОбменаЕИС.СоздатьМенеджерЗаписи();
	НоваяНастройка.Организация = СтруктураЗаписи.Организация;
	НоваяНастройка.Прочитать();
	ЗаполнитьЗначенияСвойств(НоваяНастройка, СтруктураЗаписи);
	НоваяНастройка.ОбменВключен = Истина;
	
	НоваяНастройка.Записать();
	
	Если ЭлектронноеАктированиеЕИС.РазрешаетсяИспользоватьЭлектронноеАктированиеДляПоставщиков()
		И НЕ ЭлектронноеАктированиеЕИС.ИспользоватьЭлектронноеАктированиеВЕИС() Тогда
		УстановитьПривилегированныйРежим(Истина);
		// Включием функциональную опцию.
		Константы.ИспользоватьЭлектронноеАктированиеВЕИС.Установить(Истина);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НадписьТребуетсяПолучитьЗначение()
	
	Возврат НСтр("ru='<не заполнено>'");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТекущиеНастройки()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Отбор = Новый Структура("Организация", Организация);
		Выборка = РегистрыСведений.НастройкиОбменаЕИС.Выбрать(Отбор);
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьДанныеДляПолученияСведений(ВыводитьОшибки = Ложь)
	
	ДанныеЗаполнены = Истина;
	ТекстСообщения = "";
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Если ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Не заполнена организация.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Организация");
		КонецЕсли;
		ДанныеЗаполнены = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РегистрационныйНомерЕРУЗ) Тогда
		Если ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Не заполнен номер реестровой записи в ЕРУЗ.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "РегистрационныйНомерЕРУЗ");
		КонецЕсли;
		ДанныеЗаполнены = Ложь;
	Иначе
		Если СтрДлина(СокрЛП(РегистрационныйНомерЕРУЗ)) < 8 Тогда
			Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru='Длина номера реестровой записи в ЕРУЗ меньше 8 цифр.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "РегистрационныйНомерЕРУЗ");
			КонецЕсли;
			ДанныеЗаполнены = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТокенАвторизации) Тогда
		Если ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Не заполнен токен-ключ авторизации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ТокенАвторизации");
		КонецЕсли;
		ДанныеЗаполнены = Ложь;
	Иначе
		Если СтрНайти(ТокенАвторизации, " ") > 0 Тогда
			Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru='Токен-ключ содержит пробелы.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ТокенАвторизации");
			КонецЕсли;
			ДанныеЗаполнены = Ложь;
		КонецЕсли;
		Если СтрДлина(СокрЛП(ТокенАвторизации)) < 36 Тогда
			Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru='Длина токен-ключа меньше 36 символов.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ТокенАвторизации");
			КонецЕсли;
			ДанныеЗаполнены = Ложь;
		КонецЕсли;
		Если НЕ СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(СокрЛП(ТокенАвторизации)) Тогда
			Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru='Токен-ключ имеет неверный формат.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ТокенАвторизации");
			КонецЕсли;
			ДанныеЗаполнены = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеЗаполнены;
	
КонецФункции

#КонецОбласти
